[
{
	"url": "/2018/11/08/cesbo-astra-pravim-css/",
	"title": "cesbo astra - правим css",
	"body": "Для чего? а вот к примеру: Вывести кучу каналов на тв: Создаем файл /etc/astra/mod_theme/theme.lua : astra_storage[ /tv-c.css ] = [[ .tv-c .card { margin: 1px; } .tv-c .card .card-image { display: none; } .tv-c .card .card-status { display: none; } .tv-c .card div { background-color: inherit; } .tv-c .card.card-true-3, .dark-c .card.card-false-0 { background-color: #434857; } .tv-c .card.card-true-2 { background-color: #66bb6a; } .tv-c .card.card-true-0, .dark-c .card.card-true-1 { background-color: #ef5350; } #.main-menu.fixed { position: fixed; top: 0; left: 0; width: 0%; } .main-menu { z-index: 0; } .button.icon.small { height: 0px; width: 0px; background-size: 20px; } .version { font-size: 0; } .card-stack[data-header]:before { font-size: 0px; } .card .card-name {font-weight: 600;} .main-menu.fixed+.main-content { padding-top: 2px;} ]] astra_storage[ /mod.js ] = astra_storage[ /mod.js ] .. [[ (function() { app.themes.push({ value: dark tv-c , label: For TV }); $.head.addChild($.element( link ) .addAttr( rel , stylesheet ) .addAttr( type , text/css ) .addAttr( href , /tv-c.css ) .addAttr( media , all )); })(); ]] Создаем новый процесс Астры, и запускаем: /usr/bin/astra /etc/astra/mod_theme/theme.lua -p 9000 -c /etc/monitor.conf . Добавляем туда через сервера все остальные процессы астр, в настройках меняем тему и выводим на смарт тв) (меню позади всех элементов - неудобно но попасть можно)))"
},
{
	"url": "/2018/03/20/astra-grafana/",
	"title": "Astra + Grafana",
	"body": "Небольшой мануал: Небольшой мануал: Устанавливаем Influxdb (https://portal.influxdata.com/downloads) После установки редактируем конфигурацию: в файле /etc/influxdb/influxdb.conf раскоментируем поля в секции Admin, что бы включить веб-интерфейс influxdb, и делаем service influxdb restart . Идем на http://айпинашегосервера:8083 - должна открыться админка influxdb, далее нажимаем CREATE DATABASE и называем её Astra . Тут закончили. _____ Качаем и ставим Grafana - (не ставим из apt-а - там старая версия. Нам нужна версия не ниже 4.2. Потому идем на http://grafana.org/builds/ и выбираем нужную версию там.) Делаем dpkg -i grafanа-*.deb Идем на http://айпинашегосервера:3000 - должен заработать веб-интерфейс. Логин и пароль по умолчанию - admin/admin Подключаем influxdb: Жмем кнопку Data Sources -> Add Data Source - откроется меню настроек db. пишем туда: Name: Astra Type: InfluxDB URL: http://айпинашегосервера:8086 (или localhost) Database: Astra Если в админ-панели influxdb не указывали логин и пароль, то больше ничего никуда не пишем, жмем кнопку Add. Должна появится зеленая табличка говорящая все ОК! Качаем дашборд или этот и импортируем его: Жмем кнопку Dashboards -> Import ___ Создаем папку /etc/astra/mod , в нее кладем скрипт event.lua ___ В Веб - интерфейсе Астре прописываем адрес к influxdb: (http://айпинашегосервера:8086/write?db=Astra#interval=60&total=1) Для отображения названий каналов нужно названия прописать в поле id без пробелов - ( id : Матч_ТВ ,) Перезапускаем Астру. Все сделано силами сообщества пользователей Astra. Благодарности: @Yumaxx, @VladZaitov. Если кого забыл - напишите. Наш телеграмм - канал: ТЫЦ!"
},
{
	"url": "/2018/03/14/umier-stivien-khokingh/",
	"title": "Умер Стивен Хокинг",
	"body": "Британский физик Стивен Хокинг умер на 77-м году жизни, сообщает в среду, 14 марта, The Guardian. Эту информацию подтвердила семья ученого. «Мы глубоко опечалены тем, что наш отец сегодня скончался», — сообщили дети Хокинга Люси, Роберт и Тим. Широкую известность Хокинг получил после того, как в апреле 1988 года была опубликована его научно-популярная книга «Краткая история времени». Она переведена на десятки языков и издана общим тиражом более 10 миллионов экземпляров. Ученый много внимания уделял и таким актуальным проблемам человечества, как глобальное потепление, состояние окружающей среды и социальное неравенство. Главный научный результат Хокинга связан с описанием излучения черных дыр. Он высказал гипотезу о том, что черные дыры малой массы теряют энергию, испуская излучение по своему горизонту событий, и, в конце концов, «умирают». Большую часть жизни физик провел в инвалидном кресле. Признаки бокового амиотрофического склероза, которые впоследствии привели к параличу, стали проявляться у Хокинга в начале 1960-х, когда ему было чуть больше 20 лет."
},
{
	"url": "/2018/03/09/untitled-9/",
	"title": "мысли..",
	"body": "Меня недавно спросили, почему программисты ненавидят работать с чужим кодом. Долго думал, как донести до обычного пользователя всю суть пиздеца. Решил привести небольшую аналогию: Вот представь, что тебе доверили достроить за другим прорабом лабораторию на острове. Ты приходишь на объект, а там кроме недостроенного здания: огромный вентилятор (размером со здание), большой воздушный шар и комната набитая швабрами. Почесав голову, ты разбираешь этот хлам и доделываешь лабораторию. Сдаешь объект ученным, но через 5 минут они выбегают с криком: УТЕЧКА ЯДОВИТОГО ГАЗА!!! . Как так-то, блять! Должно же работать! - в отчаянии кричишь ты и звонишь прошлому прорабу: -Вася, у нас ядовитый газ потёк! В чем проблема? -Не знаю, должно было все работать. Что-то в проекте менял? -Немного, швабры вынес… -Швабры потолок держали! -Что??? Что, блять, извините??? -Говорю, швабры потолок держали. Над ними цистерны с газом были. Очень тяжелые, пришлось в комнату снизу швабры напихать. -Ты хотя бы записку на двери повесил бы, что швабры для держания потолка! У нас тут ядовитый газ течет! Что нам делать? -Включай вентилятор. Он сдует газ с острова. -Я его, блять, демонтировал сразу же! -Зачем? -Зачем ты построил 120 тонный вентилятор? Ты не мог положить ящик блядских ПРОТИВОГАЗОВ? -Ящик противогазов искать нужно, а вентилятор у меня с прошлого заказа оставался. -Вася, я убрал твой вентилятор! Мы тут задыхаемся! -Херли вы тогда там делаете? Садитесь на воздушный шар и уебывайте!"
},
{
	"url": "/2018/03/09/odroid-xu4/",
	"title": "Odroid XU4",
	"body": "Перенес бложег на такую железку: Samsung Exynos5422 Cortex™-A15 2Ghz and Cortex™-A7 Octa core CPUs Mali-T628 MP6(OpenGL ES 3.1/2.0/1.1 and OpenCL 1.2 Full profile) 2Gbyte LPDDR3 RAM PoP stacked eMMC5.0 HS400 Flash Storage 2 x USB 3.0 Host, 1 x USB 2.0 Host Gigabit Ethernet port"
},
{
	"url": "/2017/12/11/astra-input-id/",
	"title": "astra - input id",
	"body": "Для создания карусели или переключения источников - можно использовать скрипт: ссыка Сохраняем в /etc/astra/set-input.lua запустить астру: astra -c /etc/astra/astra.conf -p 8000 /etc/astra/set-input.lua создать канал и прописать в нём все источники. чтобы выбрать источник: curl -X POST -d '{ cmd : set-input , id : channel-id , input :X}' http://admin:password@127.0.0.1:8000/ channel-id - идентификатор канала. в адресе канала указывается. можно посмотреть в конфиге. X - номер нужного входа. нумерация с единицы начинается"
},
{
	"url": "/2017/11/23/untitled-7/",
	"title": "мысли..",
	"body": "Понравилась фраза: Его вездесущие, вездеебущие и везде раздопиздящие руки нельзя было сравнить даже с кошмарной войной во Вьетнаме"
},
{
	"url": "/2017/11/14/untitled-3/",
	"title": "Еще одна заметка о сетевой подсистеме",
	"body": "Еще одним весьма важным параметром является задержка между прерываниями. Посмотреть текущее значение можно при помощи ethtool -c ethN, параметры rx-usecs и tx-usecs. Чем больше значение, тем выше задержка, но тем меньше нагрузка на процессор."
},
{
	"url": "/2016/12/25/untitled-2/",
	"title": "Картинка в тему",
	"body": ""
},
{
	"url": "/2016/06/10/pptp-v-macos-sierra/",
	"title": "PPTP в macOS Sierra",
	"body": "С проклятиями сегодня обнаружил что доблестные купертиновцы выпилили из Sierra pptp: - дескать, несекьюрно и опасно. Кстати из ios 10 они и “Slide to Unlock” удалили. Я вот до сих пор на автомате дергаю пальцем по экрану…"
}

]
